_posts/2014-01-08-Finding-bibtex-entries-with-no-downloaded-pdf.html
---
title: Finding bibtex entries with no downloaded pdf
date: 2014/01/08 10:27:29
updated: 2014/01/08 10:41:40
categories: bibtex
tags: 
---


<p>
We use bibtex for bibiliography management in our group. Almost every journal provides a utility to download bibtex entries, and you can pretty easily download bibtex entries from citeulike. It doesn't take too long though before you have a few hundred entries. You need some tools to interact with that database.
</p>

<p>
Bibtex-mode in Emacs provides some tools for working with your bibtex files. For example, you can (bibtex-validate) to check if entries are correct, and (bibtex-sort-buffer) to sort them by key. 
</p>

<p>
I have a specific workflow to entering new entries. This is what I prefer to do:
</p>

<ol class="org-ol">
<li>Go to journal, get bibtex entry, paste into bibtex file.
</li>
<li>delete the key that is used, if any
</li>
<li>type C-c C-c to autogenerate a key of my style
</li>
<li>Copy the key, download the pdf, and save the pdf as (format "%s.pdf" key) in my pdfs directory.
</li>
<li>Make an entry in a notes file for that reference. These entries are initially tagged as TODO to remind me to organize them.
</li>
</ol>

<p>
Doing this has some payoffs; my org-mode cite links can open either the bibtex entry, or the pdf file directly from the org-file! The notes file is also an org-file, which I can organize as I see fit. 
</p>

<p>
Sometimes I am lazy, and do not get all these steps done, especially the pdf download step. I like to have local copies of the pdf files so I can read them even if I am offline, and because I often annotate them using a tablet PC. It also makes it easy to send them to my students if I need to. Periodically, I like to go through my bibtex database to do some maintenance, download missing files, and notes entries etc&#x2026; The problem is how do I know which entries have downloaded pdfs or note entries? It is not that difficult with a bit of elisp. 
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp">(find-file <span style="color: #228b22;">"~/Dropbox/bibliography/references.bib"</span>)
(bibtex-map-entries (<span style="color: #8b0000;">lambda</span> (bibtex-key start end) 
                      (<span style="color: #8b0000;">let</span> ((type  (cdr (car (bibtex-parse-entry)))))                        
                        (<span style="color: #8b0000;">unless</span> (file-exists-p 
                                 (format <span style="color: #228b22;">"~/Dropbox/bibliography/bibtex-pdfs/%s.pdf"</span> bibtex-key))
                          (princ (format <span style="color: #228b22;">"%10s:  cite:%s has no pdf\n"</span> type bibtex-key))))))
</pre>
</div>

<pre class="example">
      Book:  cite:ambrose-2010-how-learn-works has no pdf
   article:  cite:gerken-2010-fluor-modul has no pdf
      Book:  cite:gray-1973-chemic-bonds has no pdf
   ARTICLE:  cite:kitchin-2003-tio2 has no pdf
   ARTICLE:  cite:kitchin-2012-prefac has no pdf
      Book:  cite:kittel-2005-introd-solid has no pdf
   ARTICLE:  cite:mccormick-2003-tio2-pd has no pdf
   ARTICLE:  cite:mhadeshwar-2004-nh3-ru has no pdf
      Misc:  cite:ni-website has no pdf
   ARTICLE:  cite:norskov-2006-respon has no pdf
      Book:  cite:reif-1965-fundam-statis has no pdf
   article:  cite:risch-2012-water-oxidat has no pdf
   ARTICLE:  cite:shultz-1995-prepar-and has no pdf
   ARTICLE:  cite:shultz-1997-prepar has no pdf
   ARTICLE:  cite:song-2002-h3pw1 has no pdf
</pre>

<p>
Using that list, I can click on those links, which takes me to the entry in file. That entry probably has a url or doi that makes it easy to navigate to the journal page where I can download the pdf file. You could improve on the code above by filtering out only articles, for example.  
</p>
<p>Copyright (C) 2014 by John Kitchin. See the <a href="/copying.html">License</a> for information about copying.<p><p><a href="/org/2014/01/08/Finding-bibtex-entries-with-no-downloaded-pdf.org">org-mode source</a><p>